
"""
这个文件主要用于一些常量定义
"""
import math



YN = 4
Y_N = 1

LZ = ["ND","GD","Ln","Mg"]

ZYDZ = [3,3,3,2,1]
#计算平衡电位
R = 8.314 #常量参数
# F = 1.4    #常量参数
T = 298.15   #变量参数
Ph = 7
F = 96485
Mn = pow(10,-6)

#交流电流密度
JHDLDEN = [pow(10,-8),pow(10,-8),pow(10,-3),pow(10,-8),4*pow(10,-6)]
#计算沉积线
ksp = {
    # "gd3+": 1.80*math.e-23,
    # "2gd3+": 1.62*math.e-23,
    # "Nd3+": 3.20*math.e-22,
    # "2Nd3+": 3.04*math.e-26,
    # "ln3+": 6.3*math.e-34,
    # "2ln3+": 3.13*math.e-71,
    # "mg2+": 5.61*math.e-12,
    # "mg2+2oh-": 3.19*math.e-7,
    "Mg(OH)2":pow(5.61,-12),
    "Gd2O3":pow(1.62,-31),
    "In2O3":pow(3.13,-71),
    "Nd2O3":pow(3.04,-26),
    "MgO":pow(3.19,-7),
    "Gd(OH)3":pow(1.8,-23),
    "In(OH)3":pow(6.03,-34),
    "Nd(OH)3":pow(3.2,-22),
}
PH = [1,4,6]


#原始数据
#摩尔质量
M = [144.2,157.3,114.8,24]
#fw质量分数 可以改变
FW = []
#原子分数
FY = [pow(55.3,-4),pow(18.9,-4),pow(13.8,-4),0.9912]

#密度
MD = [7.004,7.901,7.3,1.74]

#扩散系数
KSXS = [pow(10,-6),5.52*pow(10,-6),pow(10,-6),7.06*pow(10,-6)]


ksxs_oh=[10*pow(10,-5),9.3*pow(10,-5)]
#标准电位
BZDW = [-2.32,-2.28,-0.338,-2.356]
BZDW_OH = [0]




